<?php

echo 'Наибольшее число:' . max($_POST) . '<br/>';

echo "Наименьшее число:" . min($_POST) . '<br/>';

if ($_POST['a'] == 0) {
    $x = ++$x;
}
if ($_POST['b'] == 0) {
    $x = ++$x;
}
if ($_POST['c'] == 0) {
    $x = ++$x;
}
echo "Колличество чисел равных  0:" . $x . '<br/>';


if ($_POST['b'] > $_POST['a']) {
    $x++;
}
if ($_POST['c'] > $_POST['a']) {
    $x++;
}
echo "Колличество чисел чисел больше числа A:" . $x . '<br/>';


$summa = $_POST['a'] + $_POST['b'] + $_POST['c'];
echo "Сумма чисел равна:" . $summa . '<br/>';

$s = ($_POST['a'] + $_POST['b'] + $_POST['c']) / 3;
echo "Cреднее арифметическое число:" . $s . '<br/>';

$s='0';
if ($_POST['a'] % 2 == 0) {
    $s = $s + 1;
}
if ($_POST['b'] % 2 == 0) {
    $s = $s + 1;
}
if ($_POST['c'] % 2 == 0) {
    $s = $s + 1;
}
echo "Числа кратные 2:" . $s . '<br/>';



if ($_POST['a'] % 3 == 0) {
 $r= $r+1;
}

if ($_POST['b'] % 3 == 0) {
   $r= $r+1;
}

if ($_POST['c'] % 3 == 0) {
 $r=$r+1;
}
echo "Числа кратные 3:". $r . '<br/>';



?>



